#+BEGIN_COMMENT
.. title: NER: Building the Model
.. slug: ner-building-the-model
.. date: 2021-01-13 15:01:26 UTC-08:00
.. tags: lstm,rnn,nlp,ner
.. category: NLP
.. link: 
.. description: Building the NER model with Trax.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-31230fc3-119f-4c27-9dbf-87ade3b6be9c-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Inspecting the Model

#+begin_src python :results outut :exports both
model = NER()
# display your model
print(model)
#+end_src

#+RESULTS:
: Serial[
:   Embedding_35181_50
:   LSTM_50
:   Dense_18
:   LogSoftmax
: ]

** Sanity Check
#+begin_src python :results output :exports both
from neurotic.nlp.named_entity_recognition import NER

builder = NER(122, 666)

print(builder.model)
#+end_src

#+RESULTS:
: Serial[
:   Embedding_122_50
:   LSTM_50
:   Dense_666
:   LogSoftmax
: ]
